Repository: kevinpapst/ImportBundle
Catalog: Resources/translations/messages.*.xlf
Languages: de

# importer.introduction
source: You can import customers and projects with one simple file-upload. Download example CSV files for
de: Sie können Kunden und Projekte mit einem einfachen Dateiupload importieren. Download von Beispiel-CSV-Dateien für

# importer.how_it_works
source: How does it work?
de: Wie funktioniert das?

# importer.how_to_upload
source: Once, you upload the CSV file the importer will analyse it. Then, if everything is correct, you can review the data and finish the import by re-uploading the file with the "Preview import" checkbox deactivated. See documentation on how the CSV file should be formatted and how uploading works.
de: Sobald Sie die CSV-Datei hochgeladen haben, wird der Importer diese analysieren. Wenn alles korrekt ist, können Sie die Daten überprüfen und den Import abschließen, indem Sie die Datei erneut hochladen, nachdem Sie die "Importvorschau" deaktiviert haben. Lesen Sie in der Dokumentation nach, wie die CSV-Datei formatiert sein sollte und wie das Hochladen funktioniert.

# importer.preview
source: Preview import
de: Importvorschau

# importer.delimiter
source: Delimiter
de: Trennzeichen

# importer.file_chooser
source: File selection (CSV)
de: Dateiauswahl (CSV)

# importer.file_chooser_help
source: File ending: .csv - Max. Filesize: 1MB - Max. 1000 rows
de: Dateiendung: .csv - Max. Dateigröße: 1MB - Max. 1000 Zeilen

# importer.status
source: processed %processed% rows, failed %failed% rows
de: verarbeitet %processed% Zeilen, fehlerhaft %failed% Zeilen

# importer.button
source: Upload file
de: Datei hochladen

# importer.grandtotal
source: Customer (Grandtotal)
de: Kunden (Grandtotal)
